[Killed] Block removal mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:34:5
         IOptions<ExternalFallbackOptions> options,
         IConfiguration configuration,
         ILogger<ExternalFallbackService> logger)
-    {
-        _uploadValidator = uploadValidator;
-        _identificationProvider = identificationProvider;
-        _knowledgeProvider = knowledgeProvider;
-        _options = options.Value;
-        _configuration = configuration;
-        _logger = logger;
-    }
+    {}
 
     public async Task<ExternalFallbackServiceResult> ExecuteAsync(ExternalFallbackUpload upload, CancellationToken requestAborted)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsUnavailable_ReturnsUnavailableWithoutDetails

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:46:13
     public async Task<ExternalFallbackServiceResult> ExecuteAsync(ExternalFallbackUpload upload, CancellationToken requestAborted)
     {
         var validation = await _uploadValidator.ValidateAsync(upload, requestAborted);
-        if (!validation.IsValid)
+        if (validation.IsValid)
         {
             return new ExternalFallbackServiceResult(validation.Failure, null, "not_requested");
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsUnavailable_ReturnsUnavailableWithoutDetails

[Timeout] Statement mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:52:9
         }
 
         using var timeout = CancellationTokenSource.CreateLinkedTokenSource(requestAborted);
-        timeout.CancelAfter(TimeSpan.FromSeconds(_options.RequestTimeoutSeconds));
+        ;
         try
         {

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:62:17
             }
 
             var selected = NormalizeScientificName(identification.Candidates[0].ScientificName);
-            if (!KnowledgeEnabled())
+            if (KnowledgeEnabled())
             {
                 return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, new ExternalFallbackResult(identification, null), "not_requested");
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsUnavailable_ReturnsUnavailableWithoutDetails; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeTimesOut_KeepsIdentificationAndReturnsNeutralTimeout

[Killed] Conditional (false) mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:73:21
                 return new ExternalFallbackServiceResult(
                     ExternalFallbackUploadFailure.None,
                     new ExternalFallbackResult(identification, knowledge),
-                    knowledge is null ? "unavailable" : "available");
+                    (false?"unavailable" :"available"));
             }
             catch (OperationCanceledException) when (requestAborted.IsCancellationRequested)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsUnavailable_ReturnsUnavailableWithoutDetails

[Killed] Conditional (true) mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:73:21
                 return new ExternalFallbackServiceResult(
                     ExternalFallbackUploadFailure.None,
                     new ExternalFallbackResult(identification, knowledge),
-                    knowledge is null ? "unavailable" : "available");
+                    (true?"unavailable" :"available"));
             }
             catch (OperationCanceledException) when (requestAborted.IsCancellationRequested)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsAvailable_ReturnsAvailable

[Killed] Statement mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:77:17
             }
             catch (OperationCanceledException) when (requestAborted.IsCancellationRequested)
             {
-                throw;
+                ;
             }
             catch (OperationCanceledException) when (timeout.IsCancellationRequested)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelledDuringKnowledge_PropagatesWithoutRetry

[Survived] Statement mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:85:17
             }
             catch (Exception exception)
             {
-                _logger.LogWarning("External fallback knowledge provider failed with {ProviderStatus}", exception.GetType().Name);
+                ;
                 return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, new ExternalFallbackResult(identification, null), "failed");
             }

[Killed] Boolean mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:95:123
         }
         catch (OperationCanceledException) when (timeout.IsCancellationRequested)
         {
-            return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, null, "not_requested", TimedOut: true);
+            return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, null, "not_requested", TimedOut: false);
         }
         catch (ExternalProviderRateLimitException exception)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenIdentificationTimesOut_ReturnsNeutralTimeoutWithoutRetry

[Killed] String mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:95:96
         }
         catch (OperationCanceledException) when (timeout.IsCancellationRequested)
         {
-            return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, null, "not_requested", TimedOut: true);
+            return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, null, "", TimedOut: true);
         }
         catch (ExternalProviderRateLimitException exception)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenIdentificationTimesOut_ReturnsNeutralTimeoutWithoutRetry

[NoCoverage] String mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackService.cs:103:96
         }
         catch (ExternalProviderUnavailableException exception)
         {
-            return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, null, "not_requested", UnavailableException: exception);
+            return new ExternalFallbackServiceResult(ExternalFallbackUploadFailure.None, null, "", UnavailableException: exception);
         }
         catch (HttpRequestException exception)
