[NoCoverage] Boolean mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:21:75
 
 internal sealed record ValidatedImage(byte[] Content, string ContentType, int Width, int Height)
 {
-    public Stream OpenReadStream() => new MemoryStream(Content, writable: false);
+    public Stream OpenReadStream() => new MemoryStream(Content, writable: true);
 }
 

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:26:49
 
 internal sealed record ExternalFallbackUploadValidationResult(ValidatedImage? Image, ExternalFallbackUploadFailure Failure)
 {
-    public bool IsValid => Image is not null && Failure == ExternalFallbackUploadFailure.None;
+    public bool IsValid => Image is not null && Failure != ExternalFallbackUploadFailure.None;
 }
 
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsUnavailable_ReturnsUnavailableWithoutDetails

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:26:28
 
 internal sealed record ExternalFallbackUploadValidationResult(ValidatedImage? Image, ExternalFallbackUploadFailure Failure)
 {
-    public bool IsValid => Image is not null && Failure == ExternalFallbackUploadFailure.None;
+    public bool IsValid => Image is null && Failure == ExternalFallbackUploadFailure.None;
 }
 
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsUnavailable_ReturnsUnavailableWithoutDetails

[Killed] Block removal mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:34:5
     private readonly ExternalFallbackOptions _options;
 
     public ExternalFallbackUploadValidator(IOptions<ExternalFallbackOptions> options)
-    {
-        _options = options.Value;
-    }
+    {}
 
     public async Task<ExternalFallbackUploadValidationResult> ValidateAsync(
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenMimeIsNotAllowed_RejectsBeforeProducingValidatedImage; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry

[Killed] Logical mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:42:13
         ExternalFallbackUpload upload,
         CancellationToken cancellationToken = default)
     {
-        if (upload.Content is null || !upload.Content.CanRead || upload.DeclaredLength is <= 0)
+        if (upload.Content is null || !upload.Content.CanRead && upload.DeclaredLength is <= 0)
         {
             return Failure(ExternalFallbackUploadFailure.MissingImage);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenDeclaredLengthIsZero_RejectsAsMissingImageBeforeDecoding; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenUploadIsMissing_RejectsIt

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:42:91
         ExternalFallbackUpload upload,
         CancellationToken cancellationToken = default)
     {
-        if (upload.Content is null || !upload.Content.CanRead || upload.DeclaredLength is <= 0)
+        if (upload.Content is null || !upload.Content.CanRead || upload.DeclaredLength is < 0)
         {
             return Failure(ExternalFallbackUploadFailure.MissingImage);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenDeclaredLengthIsZero_RejectsAsMissingImageBeforeDecoding

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:47:13
             return Failure(ExternalFallbackUploadFailure.MissingImage);
         }
 
-        if (!upload.ConsentToExternalProcessing)
+        if (upload.ConsentToExternalProcessing)
         {
             return Failure(ExternalFallbackUploadFailure.ConsentRequired);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenMimeIsNotAllowed_RejectsBeforeProducingValidatedImage; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry

[Killed] Negate expression
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:52:13
             return Failure(ExternalFallbackUploadFailure.ConsentRequired);
         }
 
-        if (upload.DeclaredLength > _options.MaxImageBytes)
+        if (!(upload.DeclaredLength > _options.MaxImageBytes))
         {
             return Failure(ExternalFallbackUploadFailure.PayloadTooLarge);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenMimeIsNotAllowed_RejectsBeforeProducingValidatedImage; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:52:13
             return Failure(ExternalFallbackUploadFailure.ConsentRequired);
         }
 
-        if (upload.DeclaredLength > _options.MaxImageBytes)
+        if (upload.DeclaredLength >= _options.MaxImageBytes)
         {
             return Failure(ExternalFallbackUploadFailure.PayloadTooLarge);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenPayloadIsExactlyMaxImageBytes_AcceptsIt; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenPayloadIsFragmentedExactlyAtLimit_PreservesBytesAndUsesBoundedReads

[Killed] Negate expression
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:58:13
         }
 
         var contentType = upload.ContentType?.Trim().ToLowerInvariant();
-        if (string.IsNullOrWhiteSpace(contentType) ||
-            !_options.AllowedMediaTypes.Contains(contentType, StringComparer.OrdinalIgnoreCase))
+        if (!(string.IsNullOrWhiteSpace(contentType) ||
+            !_options.AllowedMediaTypes.Contains(contentType, StringComparer.OrdinalIgnoreCase)))
         {
             return Failure(ExternalFallbackUploadFailure.UnsupportedMediaType);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenMimeIsNotAllowed_RejectsBeforeProducingValidatedImage; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry

[Killed] Logical mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:58:13
         }
 
         var contentType = upload.ContentType?.Trim().ToLowerInvariant();
-        if (string.IsNullOrWhiteSpace(contentType) ||
-            !_options.AllowedMediaTypes.Contains(contentType, StringComparer.OrdinalIgnoreCase))
+        if (string.IsNullOrWhiteSpace(contentType) &&
+            !_options.AllowedMediaTypes.Contains(contentType, StringComparer.OrdinalIgnoreCase))
         {
             return Failure(ExternalFallbackUploadFailure.UnsupportedMediaType);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenMimeIsNotAllowed_RejectsBeforeProducingValidatedImage

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:59:13
 
         var contentType = upload.ContentType?.Trim().ToLowerInvariant();
         if (string.IsNullOrWhiteSpace(contentType) ||
-            !_options.AllowedMediaTypes.Contains(contentType, StringComparer.OrdinalIgnoreCase))
+            _options.AllowedMediaTypes.Contains(contentType, StringComparer.OrdinalIgnoreCase))
         {
             return Failure(ExternalFallbackUploadFailure.UnsupportedMediaType);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenMimeIsNotAllowed_RejectsBeforeProducingValidatedImage; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:65:13
         }
 
         var content = await ReadWithinLimitAsync(upload.Content, _options.MaxImageBytes, cancellationToken);
-        if (content is null)
+        if (content is not null)
         {
             return Failure(ExternalFallbackUploadFailure.PayloadTooLarge);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:72:13
 
         using var encoded = SKData.CreateCopy(content);
         using var codec = SKCodec.Create(encoded);
-        if (codec is null || !TryGetContentType(codec.EncodedFormat, out var detectedContentType) ||
+        if (codec is not null || !TryGetContentType(codec.EncodedFormat, out var detectedContentType) ||
             !string.Equals(contentType, detectedContentType, StringComparison.OrdinalIgnoreCase))
         {
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:73:13
         using var encoded = SKData.CreateCopy(content);
         using var codec = SKCodec.Create(encoded);
         if (codec is null || !TryGetContentType(codec.EncodedFormat, out var detectedContentType) ||
-            !string.Equals(contentType, detectedContentType, StringComparison.OrdinalIgnoreCase))
+            string.Equals(contentType, detectedContentType, StringComparison.OrdinalIgnoreCase))
         {
             return Failure(ExternalFallbackUploadFailure.InvalidImageSignature);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Negate expression
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:79:13
         }
 
         var imageInfo = codec.Info;
-        if (imageInfo.Width <= 0 || imageInfo.Height <= 0 ||
-            imageInfo.Width > _options.MaxImageWidth || imageInfo.Height > _options.MaxImageHeight)
+        if (!(imageInfo.Width <= 0 || imageInfo.Height <= 0 ||
+            imageInfo.Width > _options.MaxImageWidth || imageInfo.Height > _options.MaxImageHeight))
         {
             return Failure(ExternalFallbackUploadFailure.InvalidImageDimensions);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Logical mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:79:13
         }
 
         var imageInfo = codec.Info;
-        if (imageInfo.Width <= 0 || imageInfo.Height <= 0 ||
-            imageInfo.Width > _options.MaxImageWidth || imageInfo.Height > _options.MaxImageHeight)
+        if (imageInfo.Width <= 0 || imageInfo.Height <= 0 &&
+            imageInfo.Width > _options.MaxImageWidth || imageInfo.Height > _options.MaxImageHeight)
         {
             return Failure(ExternalFallbackUploadFailure.InvalidImageDimensions);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenDimensionsExceedLimit_RejectsIt

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:80:57
 
         var imageInfo = codec.Info;
         if (imageInfo.Width <= 0 || imageInfo.Height <= 0 ||
-            imageInfo.Width > _options.MaxImageWidth || imageInfo.Height > _options.MaxImageHeight)
+            imageInfo.Width > _options.MaxImageWidth || imageInfo.Height >= _options.MaxImageHeight)
         {
             return Failure(ExternalFallbackUploadFailure.InvalidImageDimensions);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenDimensionsAreExactlyAtLimit_AcceptsIt

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:80:13
 
         var imageInfo = codec.Info;
         if (imageInfo.Width <= 0 || imageInfo.Height <= 0 ||
-            imageInfo.Width > _options.MaxImageWidth || imageInfo.Height > _options.MaxImageHeight)
+            imageInfo.Width >= _options.MaxImageWidth || imageInfo.Height > _options.MaxImageHeight)
         {
             return Failure(ExternalFallbackUploadFailure.InvalidImageDimensions);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenDimensionsAreExactlyAtLimit_AcceptsIt

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:86:13
         }
 
         using var bitmap = new SKBitmap(imageInfo);
-        if (codec.GetPixels(bitmap.Info, bitmap.GetPixels()) != SKCodecResult.Success)
+        if (codec.GetPixels(bitmap.Info, bitmap.GetPixels()) == SKCodecResult.Success)
         {
             return Failure(ExternalFallbackUploadFailure.InvalidImageSignature);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Linq method mutation (Min() to Max())
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:100:48
 
     private static async Task<byte[]?> ReadWithinLimitAsync(Stream content, long maxBytes, CancellationToken cancellationToken)
     {
-        var maximumBufferLength = checked((int)Math.Min(maxBytes + 1, int.MaxValue));
+        var maximumBufferLength = checked((int)Math.Max(maxBytes + 1, int.MaxValue));
         await using var buffer = new MemoryStream(capacity: maximumBufferLength);
         var chunk = new byte[Math.Min(81920, maximumBufferLength)];
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Survived] Arithmetic mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:100:57
 
     private static async Task<byte[]?> ReadWithinLimitAsync(Stream content, long maxBytes, CancellationToken cancellationToken)
     {
-        var maximumBufferLength = checked((int)Math.Min(maxBytes + 1, int.MaxValue));
+        var maximumBufferLength = checked((int)Math.Min(maxBytes - 1, int.MaxValue));
         await using var buffer = new MemoryStream(capacity: maximumBufferLength);
         var chunk = new byte[Math.Min(81920, maximumBufferLength)];

[Killed] Linq method mutation (Min() to Max())
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:102:30
     {
         var maximumBufferLength = checked((int)Math.Min(maxBytes + 1, int.MaxValue));
         await using var buffer = new MemoryStream(capacity: maximumBufferLength);
-        var chunk = new byte[Math.Min(81920, maximumBufferLength)];
+        var chunk = new byte[Math.Max(81920, maximumBufferLength)];
         int read;
 
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenPayloadIsFragmentedExactlyAtLimit_PreservesBytesAndUsesBoundedReads

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:105:16
         var chunk = new byte[Math.Min(81920, maximumBufferLength)];
         int read;
 
-        while ((read = await content.ReadAsync(chunk.AsMemory(), cancellationToken)) > 0)
+        while ((read = await content.ReadAsync(chunk.AsMemory(), cancellationToken)) < 0)
         {
             if (buffer.Length + read > maxBytes)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Negate expression
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:105:16
         var chunk = new byte[Math.Min(81920, maximumBufferLength)];
         int read;
 
-        while ((read = await content.ReadAsync(chunk.AsMemory(), cancellationToken)) > 0)
+        while (!((read = await content.ReadAsync(chunk.AsMemory(), cancellationToken)) > 0))
         {
             if (buffer.Length + read > maxBytes)
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Negate expression
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:107:17
 
         while ((read = await content.ReadAsync(chunk.AsMemory(), cancellationToken)) > 0)
         {
-            if (buffer.Length + read > maxBytes)
+            if (!(buffer.Length + read > maxBytes))
             {
                 return null;
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:107:17
 
         while ((read = await content.ReadAsync(chunk.AsMemory(), cancellationToken)) > 0)
         {
-            if (buffer.Length + read > maxBytes)
+            if (buffer.Length + read >= maxBytes)
             {
                 return null;
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenPayloadIsExactlyMaxImageBytes_AcceptsIt; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenPayloadIsFragmentedExactlyAtLimit_PreservesBytesAndUsesBoundedReads

[Killed] Block removal mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:108:13
         while ((read = await content.ReadAsync(chunk.AsMemory(), cancellationToken)) > 0)
         {
             if (buffer.Length + read > maxBytes)
-            {
-                return null;
-            }
+            {}
 
             await buffer.WriteAsync(chunk.AsMemory(0, read), cancellationToken);
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenActualPayloadHasFirstByteOverLimitDespiteDeclaredLength_RejectsIt

[Killed] Statement mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:112:13
                 return null;
             }
 
-            await buffer.WriteAsync(chunk.AsMemory(0, read), cancellationToken);
+            ;
         }
 
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Conditional (true) mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:115:16
             await buffer.WriteAsync(chunk.AsMemory(0, read), cancellationToken);
         }
 
-        return buffer.Length == 0 ? null : buffer.ToArray();
+        return (true?null :buffer.ToArray());
     }
 
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:115:16
             await buffer.WriteAsync(chunk.AsMemory(0, read), cancellationToken);
         }
 
-        return buffer.Length == 0 ? null : buffer.ToArray();
+        return buffer.Length != 0 ? null : buffer.ToArray();
     }
 
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Killed] String mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:122:41
     {
         contentType = format switch
         {
-            SKEncodedImageFormat.Png => "image/png",
+            SKEncodedImageFormat.Png => "",
             SKEncodedImageFormat.Jpeg => "image/jpeg",
             _ => string.Empty
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeIsUnavailable_ReturnsUnavailableWithoutDetails

[Killed] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:126:16
             SKEncodedImageFormat.Jpeg => "image/jpeg",
             _ => string.Empty
         };
-        return contentType.Length > 0;
+        return contentType.Length < 0;
     }
 }
killedBy: ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ValidateAsync_WhenJpegIsValidAndAllowed_AcceptsLocalFixture; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenRequestIsCancelled_PropagatesWithoutRetry; ScanPlantAPI.MutationHarness.ExternalFallbackMutationHarnessTests.ExecuteAsync_WhenKnowledgeFails_KeepsIdentificationAndDegradesPredictably

[Survived] Equality mutation
ScanPlantAPI/Services/ExternalProviders/ExternalFallbackUploadValidator.cs:126:16
             SKEncodedImageFormat.Jpeg => "image/jpeg",
             _ => string.Empty
         };
-        return contentType.Length > 0;
+        return contentType.Length >= 0;
     }
 }
